# pandas
- 데이터프레임(Dataframe)과 시리즈(Series)

In [0]:
# 시리즈와 데이터프레임 두가지가 기본이다
# 자동으로 인덱스가 만들어진다

import numpy as np
import pandas as pd

In [35]:
dic = {'city': ['서울', '부산', '대전', '대구', '광주'],
        'year': [2017, 2017, 2018, 2018, 2018],
        'temp': [18, 20, 19, 21, 20]}
data = pd.DataFrame(dic) ; data

  city  year  temp
0   서울  2017    18
1   부산  2017    20
2   대전  2018    19
3   대구  2018    21
4   광주  2018    20

In [36]:
# 안쪽의 꺽쇠는 리스트 데이터를 담는 역할
# 바깥의 꺽쇠는 인덱스 index[0]
data[['year', 'city', 'temp']]

   year city  temp
0  2017   서울    18
1  2017   부산    20
2  2018   대전    19
3  2018   대구    21
4  2018   광주    20

In [38]:
data.index = ['1','2','3','4','5'] ; data

   도시    연도  날씨
1  서울  2017  18
2  부산  2017  20
3  대전  2018  19
4  대구  2018  21
5  광주  2018  20

In [39]:
data.columns = ['도시','연도','날씨'] ; data

   도시    연도  날씨
1  서울  2017  18
2  부산  2017  20
3  대전  2018  19
4  대구  2018  21
5  광주  2018  20

In [40]:
data.set_index(['도시'])

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [41]:
data['연도']

1    2017
2    2017
3    2018
4    2018
5    2018
Name: 연도, dtype: int64

In [42]:
data.연도

1    2017
2    2017
3    2018
4    2018
5    2018
Name: 연도, dtype: int64

In [43]:
data

   도시    연도  날씨
1  서울  2017  18
2  부산  2017  20
3  대전  2018  19
4  대구  2018  21
5  광주  2018  20

In [44]:
data.loc['1']

도시      서울
연도    2017
날씨      18
Name: 1, dtype: object

In [47]:
data

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [48]:
data.set_index(['도시'], inplace=True) ; data

KeyError: ignored

In [49]:
data.loc['서울']

연도    2017
날씨      18
Name: 서울, dtype: int64

In [50]:
data.loc[['서울','부산']]

      연도  날씨
도시
서울  2017  18
부산  2017  20

In [51]:
data.iloc[1:3]

      연도  날씨
도시
부산  2017  20
대전  2018  19

In [52]:
cars = [50,40,20,30,10]
data['car'] = cars ; data

      연도  날씨  car
도시
서울  2017  18   50
부산  2017  20   40
대전  2018  19   20
대구  2018  21   30
광주  2018  20   10

In [54]:
data['high'] = data.car >= 30 ; data

      연도  날씨  car   high
도시
서울  2017  18   50   True
부산  2017  20   40   True
대전  2018  19   20  False
대구  2018  21   30   True
광주  2018  20   10  False

In [55]:
data.drop('car', 1)

      연도  날씨   high
도시
서울  2017  18   True
부산  2017  20   True
대전  2018  19  False
대구  2018  21   True
광주  2018  20  False

In [56]:
data.drop(['car', 'high'], 1)

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [69]:
data['Random'] = np.random.rand(5)
data

      연도  날씨  car   high    Random
도시
서울  2017  18   50   True  0.106959
부산  2017  20   40   True  0.592496
대전  2018  19   20  False  0.608790
대구  2018  21   30   True  0.718590
광주  2018  20   10  False  0.726059

## 람다 함수

In [70]:
f = lambda x: x.max() - x.min()

df = pd.DataFrame(np.arange(12).reshape(4, 3), 
                  columns=['A', 'B', 'C'], index=['a', 'b', 'c', 'd'])
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [71]:
df.apply(f)

A    9
B    9
C    9
dtype: int64

In [72]:
df.apply(f, 1)

a    2
b    2
c    2
d    2
dtype: int64

## Series

In [0]:
# 파이썬 기본 타입인  딕셔너리로부터 시리즈를 만들 수 있다
dic = {'서울':800, '부산':150, '대구': 100}
dic

{'서울': 800, '부산': 150, '대구': 100}

In [0]:
s = pd.Series(dic) ; s

서울    800
부산    150
대구    100
dtype: int64